Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/security_and_emergency_services/irish_coast_guard.html.txt.tmx
Source language: en
Languages: ga

source: • Radio medical advice service
ga: • Seirbhís chomhairle leighis raidió

source: The Irish Coast Guard is a division of the Department of Transport, Tourism and Sport
ga: Is rannán é Garda Cósta na hÉireann de chuid na Roinne Iompair, Turasóireachta agus Spóirt

source: It has responsibility for the national system of marine communications, surveillance and emergency management in Ireland's Exclusive Economic Zone (EEZ) and certain inland waterways
ga: Is airsean a luíonn an fhreagracht as an gcóras náisiúnta cumarsáide, faireachais agus bainistithe éigeandála muirí i gCrios Eacnamaíoch Eisiach (CEE) na hÉireann agus ar uiscebhealaí intíre áirithe

source: (An EEZ is the sea zone over which a country claims exclusive rights for fishing, drilling, and other economic activities.)
ga: (Is ionann CEE agus crios na mara thar a n-éilíonn tír éigin cearta eisiacha don iascach, druileáil agus gníomhaíochtaí eacnamaíocha eile nach iad.)

source: It is responsible for the response to maritime accidents which involves:
ga: Is eisean a bhíonn freagrach as an bhfreagra do thionóiscí muirí, lena mbaineann:

source: • Counter pollution and ship casualty operations
ga: • Oibríochtaí i gcoinne an truaillithe agus taismeach long

source: It also has responsibility for vessel traffic monitoring
ga: Is airsean freisin a luíonn an fhreagracht as monatóireacht tráchta soithí

source: The main roles of the Irish Coast Guard are:
ga: Is iad príomhróil Gharda Cósta na hÉireann ná:

source: • To rescue people from danger at sea or on land
ga: • Daoine a tharrtháil slán ón gcontúirt ar muir nó ar talamh

source: • To organise immediate medical transport
ga: • Iompar leighis láithreach a eagrú

source: • To assist boats and ships within the country's jurisdiction
ga: • Cúnamh le báid agus longa laistigh de dhlínse na tíre

source: It has marine rescue centres in Dublin, Malin Head (Co Donegal) and Valentia Island (Co Kerry) which are responsible for coordinating search and rescue operations in their areas of responsibility
ga: Tá ionaid tarrthála muirí aige i mBaile Átha Cliath, i gCeann Mhálanna (Co. Dhún na nGall) agus istigh i nDairbhre (Co. Chiarraí) as a mbíonn freagracht chun oibríochtaí cuardaigh agus tarrthála ina limistéir chúraim faoi seach

source: The limits of the Irish Marine Search and Rescue Region are approximately 200 miles off the west coast, 30 miles off the south coast and dividing the Irish Sea
ga: Is ionann teorainneacha Réigiún Cuardaigh agus Tarrthála Muirí na hÉireann agus tuairim 200 míle amach ón gcósta thiar, 30 míle amach ón gcósta theas agus a leath thiar de Mhuir Éireann

source: The centres maintain a communications watch which includes a distress watch on the international VHF distress frequency
ga: Cothabhálann na hionaid faire chumarsáide lena n-áirítear faire ghuaise ar an minicíocht ghuaise VHF idirnáisiúnta

source: The rescue centres also broadcast maritime safety information which contains navigation and weather warnings on VHF radio and, in some cases, MF radio in accordance with published schedules
ga: Craolann na hionaid tarrthála faisnéis sábháilteachta muirí freisin, ina bhfaightear rabhaidh loingseoireachta agus aimsire ar raidió VHF, agus i roinnt cásanna ar raidió MF i gcomhréir le sceidil foilsithe

source: The Irish Coast Guard has about 50 coast guard units positioned at strategic locations around the coastline and on inland waterways
ga: Tá isteach agus amach ar 50 aonad gharda cósta ag Garda Cósta na hÉireann suite ag suíomhanna straitéiseacha timpeall an chósta agus ar uiscebhealaí intíre

source: They are staffed by volunteers and are equipped to carry out search, cliff and coastal rescue
ga: Bíonn foireann saorálaithe iontu agus iad trealmhaithe chun cuardach, tarrtháil aille agus chósta a dhéanamh

source: In addition to the coast guard units, the Irish Coast Guard can also use as a resource for search and rescue:
ga: Is féidir le Garda Cósta na hÉireann leas a bhaint mar acmhainn don chuardach agus tarrtháil freisin, anuas ar na haonaid gharda cósta:

source: The Irish Coast Guard operates search and rescue helicopters from Dublin, Waterford, Shannon and Sligo
ga: Oibríonn Garda Cósta na hÉireann héileacaptair chuardaigh agus tarrthála ó Bhaile Átha Cliath, Port Láirge, Sionainn agus Sligeach

source: They respond to emergencies at sea and on inland waterways, offshore islands and mountains (32 counties)
ga: Freagraíonn siad d’éigeandálaí ar farraige agus ar uiscebhealaí intíre, ar oileáin amach ón gcósta agus ar na sléibhte (32 contae)

source: Radio medical advice service
ga: Seirbhís chomhairle leighis raidió

source: The Irish Coast Guard also provides a radio medical advice service
ga: Soláthraíonn Garda Cósta na hÉireann seirbhís chomhairle leighis raidió freisin

source: If a vessel makes a call on either VHF or MF radio, or a telephone call requiring medical advice or assistance, it is provided with a radio or telephone link to Medico Cork in Cork University Hospital or to a foreign medico centre. If the medical advice requires that the casualty be taken off the vessel, the marine rescue centre providing the link arranges for the casualty to be transported from the vessel to a hospital
ga: Má chraolann soitheach glao ar raidió VHF nó MF, nó glao gutháin ag iarraidh comhairle nó cúnaimh leighis, soláthraítear é sin le nasc raidió nó gutháin chuig Liacht Chorcaí in Ospidéal na hOllscoile Chorcaí nó chuig ionad liachta eachtrach Má theastaíonn de réir na comhairle leighis go mbaintear an taismeach den soitheach, is é an t-ionad tarrthála muirí a sholáthraíonn an nasc a eagraíonn d’iompar an taismigh ón soitheach chuig ospidéal éigin

source: The Irish Coast Guard has a role with regard to the protection of the ocean and the coasts against pollution
ga: Feidhmíonn Garda Cósta na hÉireann ról maidir le cosaint an aigéin agus na gcóstaí i gcoinne an truaillithe

source: In the case of an imminent pollution accident, it has the right to intervene in ships operation
ga: I gcás tionóisce truaillithe atá ar tí briseadh, bíonn an ceart aige chun idirghabháil in oibriú na loinge

source: The Coast Guard’s National Maritime Operations Centre based in Dublin coordinates the response to marine pollution incidents within the EEZ
ga: Is é Ionad Oibríochtaí Muirí Náisiúnta an Gharda Cósta bunaithe i mBaile Átha Cliath a chomhordaíonn an freagra do theagmhais truaillithe muirí laistigh den CEE

source: If you want to report someone in trouble at sea or on the cliffs or coast, dial 112 or 999 and ask for the Coast Guard
ga: Má theastaíonn uait duine éigin i mbaol ar farraige nó leis an aill nó ag an gcósta a thuairisciú, diailigh 112 nó 999 agus iarr ar an nGarda Cósta

source: If you are in trouble at sea, call on VHF Channel 16 or MF 2182 KHz, or use VHF Digital Selective Calling (DSC)
ga: Má bhíonn tú i mbaol ar farraige, glaoigh ar Chainéal VHF 16 nó MF 2182 KHz, nó bain leas as Glaoch Roghnaitheach Digiteach VHF (GRD)

source: If you want to report a marine pollution incident, contact the Dublin marine rescue centre, Tel: (01) 662 0922, Email: mrccdublin@irishcoastguard.ie
ga: Má theastaíonn uait teagmhas truaillithe muirí a thuairisciú, déan teagmháil le hionad tarrthála muirí Bhaile Átha Cliath, Fón: (01) 662 0922, Ríomhphost: mrccdublin@irishcoastguard.ie
